tasks/app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    if @task.save
---
INSERT INTO "tasks" ("title", "done", "desc", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "aa"], ["done", 0], ["desc", "bb"], ["created_at", "2020-02-06 14:27:37.424347"], ["updated_at", "2020-02-06 14:27:37.424347"]]

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "done" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["done", 1], ["updated_at", "2019-07-14 16:12:21.802979"], ["id", 38]]